УправДом/src/Documents/УстановкаПервичныхДанныхЭлектроснабжения/УстановкаПервичныхДанныхЭлектроснабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаПервичныхДанныхЭлектроснабжения</name>
  <registerRecords>InformationRegister.СведенияПоПлатежам</registerRecords>
  <registerRecords>AccumulationRegister.ПотреблениеКомунальныхУслуг</registerRecords>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийОплаченныйМесяц</name>
    <type>
      <types>EnumRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийОплаченныйПериодСлужебный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачальныеПоказания</name>
    <attributes>
      <name>КрайниеПереданныеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайниеОплаченныеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/СведенияПоПлатежам/СведенияПоПлатежам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоПлатежам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущиеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/AccumulationRegisters/ПотреблениеКомунальныхУслуг/ПотреблениеКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотреблениеКомунальныхУслуг</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправДом/src/Documents/УстановкаПервичныхДанныхЭлектроснабжения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий	
	
Процедура ОбработкаПроведения(Отказ, Режим)
	
   // Проверка, проведен ли текущий документ, для запрета перепрведения	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СведенияПоПлатежам.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.СведенияПоПлатежам КАК СведенияПоПлатежам
		|ГДЕ
		|	СведенияПоПлатежам.Регистратор = &Ссылка
		|	И СведенияПоПлатежам.ВидПлатежа = &ВидПлатежа";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидПлатежа", ВидПлатежа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = 
		"Повторное проведение документа запрещено. Для изменения необходимо сначала отменить проведение.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	// Проверка, утановлены ли уже первичные данные.	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаПервичныхДанныхЭлектроснабжения.Представление КАК Представление
		|ИЗ
		|	Документ.УстановкаПервичныхДанныхЭлектроснабжения КАК УстановкаПервичныхДанныхЭлектроснабжения
		|ГДЕ
		|	УстановкаПервичныхДанныхЭлектроснабжения.Проведен
		|	И УстановкаПервичныхДанныхЭлектроснабжения.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выгрузить()[0];
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Первичные данные электроснабжения уже установлены! Регистратор : "
				 + Выборка.Представление;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
			
	// регистр СведенияПоПлатежам
	Движения.СведенияПоПлатежам.Записывать = Истина;
	Для Каждого Строка Из НачальныеПоказания Цикл
		ДвижениеСведения = Движения.СведенияПоПлатежам.Добавить();
		ДвижениеСведения.Период = КрайнийОплаченныйПериодСлужебный;
		ДвижениеСведения.ВидПлатежа = ВидПлатежа;
		ДвижениеСведения.ТекущиеПоказания = Строка.КрайниеПереданныеПоказания;
		ДвижениеСведения.ПоказанияНачисления = Строка.КрайниеОплаченныеПоказания;
		ДвижениеСведения.Количество = Строка.Количество;
		ДвижениеСведения.Сумма = Строка.СуммаПлатежа;		
	КонецЦикла;
	
	// регистр накопления ПотреблениеКомунальныхУслуг обороты
	Движения.ПотреблениеКомунальныхУслуг.Записывать = Истина;
	Для Каждого Строка Из НачальныеПоказания Цикл
		ДвижениеПотребление = Движения.ПотреблениеКомунальныхУслуг.Добавить();
		ДвижениеПотребление.Период = КрайнийОплаченныйПериодСлужебный;
		ДвижениеПотребление.ВидПлатежа = ВидПлатежа;
		ДвижениеПотребление.Количество = Строка.Количество;
		ДвижениеПотребление.Сумма = Строка.СуммаПлатежа;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
